ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/adc.h
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- ADC_CR : (ADC Offset: 0x0) Control Register -------- */
#define ADC_CR_SWRST (0x1u << 0) /**< \brief (ADC_CR) Software Reset */
#define ADC_CR_START (0x1u << 1) /**< \brief (ADC_CR) Start Conversion */
#define ADC_CR_SWFIFO (0x1u << 3) /**< \brief (ADC_CR) Software FIFO Reset */
#define ADC_CR_CMPRST (0x1u << 4) /**< \brief (ADC_CR) Comparison Restart */
/* -------- ADC_MR : (ADC Offset: 0x4) Mode Register -------- */
#define ADC_MR_TRGSEL_Pos 1
#define ADC_MR_TRGSEL_Msk (0x7u << ADC_MR_TRGSEL_Pos) /**< \brief (ADC_MR) Trigger Selection */
#define ADC_MR_TRGSEL(value) ((ADC_MR_TRGSEL_Msk & ((value) << ADC_MR_TRGSEL_Pos)))
#define   ADC_MR_TRGSEL_ADC_TRIG0 (0x0u << 1) /**< \brief (ADC_MR) PWM event line 0 */
#define   ADC_MR_TRGSEL_ADC_TRIG1 (0x1u << 1) /**< \brief (ADC_MR) TIOA0 TC0 */
#define   ADC_MR_TRGSEL_ADC_TRIG2 (0x2u << 1) /**< \brief (ADC_MR) TIOA1 TC0 */
#define   ADC_MR_TRGSEL_ADC_TRIG3 (0x3u << 1) /**< \brief (ADC_MR) TIOA2 TC0 */
#define   ADC_MR_TRGSEL_ADC_TRIG4 (0x4u << 1) /**< \brief (ADC_MR) TIOA0 TC1 */
#define   ADC_MR_TRGSEL_ADC_TRIG5 (0x5u << 1) /**< \brief (ADC_MR) TIOA1 TC1 */
#define   ADC_MR_TRGSEL_ADC_TRIG6 (0x6u << 1) /**< \brief (ADC_MR) RTCOUT0 */
#define ADC_MR_SLEEP (0x1u << 5) /**< \brief (ADC_MR) Sleep Mode */
#define   ADC_MR_SLEEP_NORMAL (0x0u << 5) /**< \brief (ADC_MR) Normal mode: The ADC core and reference voltage circuitry are kept on between conversions. */
#define   ADC_MR_SLEEP_SLEEP (0x1u << 5) /**< \brief (ADC_MR) Sleep mode: The wakeup time can be modified by programming the FWUP bit. */
#define ADC_MR_FWUP (0x1u << 6) /**< \brief (ADC_MR) Fast Wakeup */
#define   ADC_MR_FWUP_OFF (0x0u << 6) /**< \brief (ADC_MR) If SLEEP is 1, then both ADC core and reference voltage circuitry are off between conversions. */
#define   ADC_MR_FWUP_ON (0x1u << 6) /**< \brief (ADC_MR) If SLEEP is 1, then Fast Wakeup Sleep mode: The voltage reference is on between conversions and ADC core is off. */
#define ADC_MR_PRESCAL_Pos 8
#define ADC_MR_PRESCAL_Msk (0xffu << ADC_MR_PRESCAL_Pos) /**< \brief (ADC_MR) Prescaler Rate Selection */
#define ADC_MR_PRESCAL(value) ((ADC_MR_PRESCAL_Msk & ((value) << ADC_MR_PRESCAL_Pos)))
#define ADC_MR_STARTUP_Pos 16
#define ADC_MR_STARTUP_Msk (0xfu << ADC_MR_STARTUP_Pos) /**< \brief (ADC_MR) Startup Time */
#define ADC_MR_STARTUP(value) ((ADC_MR_STARTUP_Msk & ((value) << ADC_MR_STARTUP_Pos)))
#define   ADC_MR_STARTUP_SUT0 (0x0u << 16) /**< \brief (ADC_MR) 0 period of ADCCLK */
#define   ADC_MR_STARTUP_SUT8 (0x1u << 16) /**< \brief (ADC_MR) 8 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT16 (0x2u << 16) /**< \brief (ADC_MR) 16 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT24 (0x3u << 16) /**< \brief (ADC_MR) 24 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT64 (0x4u << 16) /**< \brief (ADC_MR) 64 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT80 (0x5u << 16) /**< \brief (ADC_MR) 80 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT96 (0x6u << 16) /**< \brief (ADC_MR) 96 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT112 (0x7u << 16) /**< \brief (ADC_MR) 112 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT512 (0x8u << 16) /**< \brief (ADC_MR) 512 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT576 (0x9u << 16) /**< \brief (ADC_MR) 576 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT640 (0xAu << 16) /**< \brief (ADC_MR) 640 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT704 (0xBu << 16) /**< \brief (ADC_MR) 704 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT768 (0xCu << 16) /**< \brief (ADC_MR) 768 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT832 (0xDu << 16) /**< \brief (ADC_MR) 832 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT896 (0xEu << 16) /**< \brief (ADC_MR) 896 periods of ADCCLK */
#define   ADC_MR_STARTUP_SUT960 (0xFu << 16) /**< \brief (ADC_MR) 960 periods of ADCCLK */
#define ADC_MR_ANACH (0x1u << 23) /**< \brief (ADC_MR) Analog Change */
#define   ADC_MR_ANACH_NONE (0x0u << 23) /**< \brief (ADC_MR) No analog change on channel switching: DIFF0 is used for all channels. */
#define   ADC_MR_ANACH_ALLOWED (0x1u << 23) /**< \brief (ADC_MR) Allows different analog settings for each channel. See ADC Channel Configuration Register. */
#define ADC_MR_TRACKTIM_Pos 24
#define ADC_MR_TRACKTIM_Msk (0xfu << ADC_MR_TRACKTIM_Pos) /**< \brief (ADC_MR) Tracking Time */
#define ADC_MR_TRACKTIM(value) ((ADC_MR_TRACKTIM_Msk & ((value) << ADC_MR_TRACKTIM_Pos)))
#define ADC_MR_TRANSFER_Pos 28
#define ADC_MR_TRANSFER_Msk (0x3u << ADC_MR_TRANSFER_Pos) /**< \brief (ADC_MR) Transfer Time */
#define ADC_MR_TRANSFER(value) ((ADC_MR_TRANSFER_Msk & ((value) << ADC_MR_TRANSFER_Pos)))
#define ADC_MR_USEQ (0x1u << 31) /**< \brief (ADC_MR) User Sequence Enable */
#define   ADC_MR_USEQ_NUM_ORDER (0x0u << 31) /**< \brief (ADC_MR) Normal mode: The controller converts channels in a simple numeric order depending only on the channel index. */
#define   ADC_MR_USEQ_REG_ORDER (0x1u << 31) /**< \brief (ADC_MR) User Sequence mode: The sequence respects what is defined in the ADC_SEQR1 and ADC_SEQR2 registers and can be used to convert the same channel several times. */
/* -------- ADC_SEQR1 : (ADC Offset: 0x8) Channel Sequence Register 1 -------- */
#define ADC_SEQR1_USCH1_Pos 0
#define ADC_SEQR1_USCH1_Msk (0xfu << ADC_SEQR1_USCH1_Pos) /**< \brief (ADC_SEQR1) User Sequence Number 1 */
#define ADC_SEQR1_USCH1(value) ((ADC_SEQR1_USCH1_Msk & ((value) << ADC_SEQR1_USCH1_Pos)))
#define ADC_SEQR1_USCH2_Pos 4
#define ADC_SEQR1_USCH2_Msk (0xfu << ADC_SEQR1_USCH2_Pos) /**< \brief (ADC_SEQR1) User Sequence Number 2 */
#define ADC_SEQR1_USCH2(value) ((ADC_SEQR1_USCH2_Msk & ((value) << ADC_SEQR1_USCH2_Pos)))
#define ADC_SEQR1_USCH3_Pos 8
#define ADC_SEQR1_USCH3_Msk (0xfu << ADC_SEQR1_USCH3_Pos) /**< \brief (ADC_SEQR1) User Sequence Number 3 */
#define ADC_SEQR1_USCH3(value) ((ADC_SEQR1_USCH3_Msk & ((value) << ADC_SEQR1_USCH3_Pos)))
#define ADC_SEQR1_USCH4_Pos 12
#define ADC_SEQR1_USCH4_Msk (0xfu << ADC_SEQR1_USCH4_Pos) /**< \brief (ADC_SEQR1) User Sequence Number 4 */
#define ADC_SEQR1_USCH4(value) ((ADC_SEQR1_USCH4_Msk & ((value) << ADC_SEQR1_USCH4_Pos)))
#define ADC_SEQR1_USCH5_Pos 16
#define ADC_SEQR1_USCH5_Msk (0xfu << ADC_SEQR1_USCH5_Pos) /**< \brief (ADC_SEQR1) User Sequence Number 5 */
#define ADC_SEQR1_USCH5(value) ((ADC_SEQR1_USCH5_Msk & ((value) << ADC_SEQR1_USCH5_Pos)))
#define ADC_SEQR1_USCH6_Pos 20
#define ADC_SEQR1_USCH6_Msk (0xfu << ADC_SEQR1_USCH6_Pos) /**< \brief (ADC_SEQR1) User Sequence Number 6 */
#define ADC_SEQR1_USCH6(value) ((ADC_SEQR1_USCH6_Msk & ((value) << ADC_SEQR1_USCH6_Pos)))
#define ADC_SEQR1_USCH7_Pos 24
#define ADC_SEQR1_USCH7_Msk (0xfu << ADC_SEQR1_USCH7_Pos) /**< \brief (ADC_SEQR1) User Sequence Number 7 */
#define ADC_SEQR1_USCH7(value) ((ADC_SEQR1_USCH7_Msk & ((value) << ADC_SEQR1_USCH7_Pos)))
#define ADC_SEQR1_USCH8_Pos 28
#define ADC_SEQR1_USCH8_Msk (0xfu << ADC_SEQR1_USCH8_Pos) /**< \brief (ADC_SEQR1) User Sequence Number 8 */
#define ADC_SEQR1_USCH8(value) ((ADC_SEQR1_USCH8_Msk & ((value) << ADC_SEQR1_USCH8_Pos)))
/* -------- ADC_SEQR2 : (ADC Offset: 0xC) Channel Sequence Register 2 -------- */
#define ADC_SEQR2_USCH9_Pos 0
#define ADC_SEQR2_USCH9_Msk (0xfu << ADC_SEQR2_USCH9_Pos) /**< \brief (ADC_SEQR2) User Sequence Number 9 */
#define ADC_SEQR2_USCH9(value) ((ADC_SEQR2_USCH9_Msk & ((value) << ADC_SEQR2_USCH9_Pos)))
#define ADC_SEQR2_USCH10_Pos 4
#define ADC_SEQR2_USCH10_Msk (0xfu << ADC_SEQR2_USCH10_Pos) /**< \brief (ADC_SEQR2) User Sequence Number 10 */
#define ADC_SEQR2_USCH10(value) ((ADC_SEQR2_USCH10_Msk & ((value) << ADC_SEQR2_USCH10_Pos)))
#define ADC_SEQR2_USCH11_Pos 8
#define ADC_SEQR2_USCH11_Msk (0xfu << ADC_SEQR2_USCH11_Pos) /**< \brief (ADC_SEQR2) User Sequence Number 11 */
#define ADC_SEQR2_USCH11(value) ((ADC_SEQR2_USCH11_Msk & ((value) << ADC_SEQR2_USCH11_Pos)))
#define ADC_SEQR2_USCH12_Pos 12
#define ADC_SEQR2_USCH12_Msk (0xfu << ADC_SEQR2_USCH12_Pos) /**< \brief (ADC_SEQR2) User Sequence Number 12 */
#define ADC_SEQR2_USCH12(value) ((ADC_SEQR2_USCH12_Msk & ((value) << ADC_SEQR2_USCH12_Pos)))
#define ADC_SEQR2_USCH13_Pos 16
#define ADC_SEQR2_USCH13_Msk (0xfu << ADC_SEQR2_USCH13_Pos) /**< \brief (ADC_SEQR2) User Sequence Number 13 */
#define ADC_SEQR2_USCH13(value) ((ADC_SEQR2_USCH13_Msk & ((value) << ADC_SEQR2_USCH13_Pos)))
#define ADC_SEQR2_USCH14_Pos 20
#define ADC_SEQR2_USCH14_Msk (0xfu << ADC_SEQR2_USCH14_Pos) /**< \brief (ADC_SEQR2) User Sequence Number 14 */
#define ADC_SEQR2_USCH14(value) ((ADC_SEQR2_USCH14_Msk & ((value) << ADC_SEQR2_USCH14_Pos)))
#define ADC_SEQR2_USCH15_Pos 24
#define ADC_SEQR2_USCH15_Msk (0xfu << ADC_SEQR2_USCH15_Pos) /**< \brief (ADC_SEQR2) User Sequence Number 15 */
#define ADC_SEQR2_USCH15(value) ((ADC_SEQR2_USCH15_Msk & ((value) << ADC_SEQR2_USCH15_Pos)))
#define ADC_SEQR2_USCH16_Pos 28
#define ADC_SEQR2_USCH16_Msk (0xfu << ADC_SEQR2_USCH16_Pos) /**< \brief (ADC_SEQR2) User Sequence Number 16 */
#define ADC_SEQR2_USCH16(value) ((ADC_SEQR2_USCH16_Msk & ((value) << ADC_SEQR2_USCH16_Pos)))
/* -------- ADC_CHER : (ADC Offset: 0x10) Channel Enable Register -------- */
#define ADC_CHER_CH0 (0x1u << 0) /**< \brief (ADC_CHER) Channel 0 Enable */
#define ADC_CHER_CH1 (0x1u << 1) /**< \brief (ADC_CHER) Channel 1 Enable */
#define ADC_CHER_CH2 (0x1u << 2) /**< \brief (ADC_CHER) Channel 2 Enable */
#define ADC_CHER_CH3 (0x1u << 3) /**< \brief (ADC_CHER) Channel 3 Enable */
#define ADC_CHER_CH4 (0x1u << 4) /**< \brief (ADC_CHER) Channel 4 Enable */
#define ADC_CHER_CH5 (0x1u << 5) /**< \brief (ADC_CHER) Channel 5 Enable */
#define ADC_CHER_CH6 (0x1u << 6) /**< \brief (ADC_CHER) Channel 6 Enable */
#define ADC_CHER_CH7 (0x1u << 7) /**< \brief (ADC_CHER) Channel 7 Enable */
/* -------- ADC_CHDR : (ADC Offset: 0x14) Channel Disable Register -------- */
#define ADC_CHDR_CH0 (0x1u << 0) /**< \brief (ADC_CHDR) Channel 0 Disable */
#define ADC_CHDR_CH1 (0x1u << 1) /**< \brief (ADC_CHDR) Channel 1 Disable */
#define ADC_CHDR_CH2 (0x1u << 2) /**< \brief (ADC_CHDR) Channel 2 Disable */
#define ADC_CHDR_CH3 (0x1u << 3) /**< \brief (ADC_CHDR) Channel 3 Disable */
#define ADC_CHDR_CH4 (0x1u << 4) /**< \brief (ADC_CHDR) Channel 4 Disable */
#define ADC_CHDR_CH5 (0x1u << 5) /**< \brief (ADC_CHDR) Channel 5 Disable */
#define ADC_CHDR_CH6 (0x1u << 6) /**< \brief (ADC_CHDR) Channel 6 Disable */
#define ADC_CHDR_CH7 (0x1u << 7) /**< \brief (ADC_CHDR) Channel 7 Disable */
/* -------- ADC_CHSR : (ADC Offset: 0x18) Channel Status Register -------- */
#define ADC_CHSR_CH0 (0x1u << 0) /**< \brief (ADC_CHSR) Channel 0 Status */
#define ADC_CHSR_CH1 (0x1u << 1) /**< \brief (ADC_CHSR) Channel 1 Status */
#define ADC_CHSR_CH2 (0x1u << 2) /**< \brief (ADC_CHSR) Channel 2 Status */
#define ADC_CHSR_CH3 (0x1u << 3) /**< \brief (ADC_CHSR) Channel 3 Status */
#define ADC_CHSR_CH4 (0x1u << 4) /**< \brief (ADC_CHSR) Channel 4 Status */
#define ADC_CHSR_CH5 (0x1u << 5) /**< \brief (ADC_CHSR) Channel 5 Status */
#define ADC_CHSR_CH6 (0x1u << 6) /**< \brief (ADC_CHSR) Channel 6 Status */
#define ADC_CHSR_CH7 (0x1u << 7) /**< \brief (ADC_CHSR) Channel 7 Status */
/* -------- ADC_LCDR : (ADC Offset: 0x20) Last Converted Data Register -------- */
#define ADC_LCDR_LDATA_Pos 0
#define ADC_LCDR_LDATA_Msk (0xffffu << ADC_LCDR_LDATA_Pos) /**< \brief (ADC_LCDR) Last Data Converted */
#define ADC_LCDR_CHNBOSR_Pos 24
#define ADC_LCDR_CHNBOSR_Msk (0x1fu << ADC_LCDR_CHNBOSR_Pos) /**< \brief (ADC_LCDR) Channel Number in Oversampling Mode */
#define ADC_LCDR_NO_OSR_LDATA_Pos 0
#define ADC_LCDR_NO_OSR_LDATA_Msk (0xfffu << ADC_LCDR_NO_OSR_LDATA_Pos) /**< \brief (ADC_LCDR) Last Data Converted when No Oversampling */
#define ADC_LCDR_NO_OSR_CHNB_Pos 12
#define ADC_LCDR_NO_OSR_CHNB_Msk (0xfu << ADC_LCDR_NO_OSR_CHNB_Pos) /**< \brief (ADC_LCDR) Channel Number when No Oversampling */
/* -------- ADC_IER : (ADC Offset: 0x24) Interrupt Enable Register -------- */
#define ADC_IER_RXRDY (0x1u << 0) /**< \brief (ADC_IER) Receive Ready Interrupt Enable */
#define ADC_IER_RXEMPTY (0x1u << 1) /**< \brief (ADC_IER) Receive FIFO Empty Interrupt Enable */
#define ADC_IER_RXFULL (0x1u << 2) /**< \brief (ADC_IER) Receive FIFO Full Interrupt Enable */
#define ADC_IER_RXCHUNK (0x1u << 3) /**< \brief (ADC_IER) Receive FIFO Chunk Interrupt Enable */
#define ADC_IER_RXUDR (0x1u << 4) /**< \brief (ADC_IER) Receive Under Flow Interrupt Enable */
#define ADC_IER_RXOVR (0x1u << 5) /**< \brief (ADC_IER) Receive Over Flow Interrupt Enable */
#define ADC_IER_VADCSMEV (0x1u << 6) /**< \brief (ADC_IER) VDD ADC Supply Monitor Event Interrupt Enable */
#define ADC_IER_EOS (0x1u << 18) /**< \brief (ADC_IER) End Of Sequence Interrupt Enable */
#define ADC_IER_TEMPCHG (0x1u << 19) /**< \brief (ADC_IER) Temperature Change Interrupt Enable */
#define ADC_IER_DRDY (0x1u << 24) /**< \brief (ADC_IER) Data Ready Interrupt Enable */
#define ADC_IER_GOVRE (0x1u << 25) /**< \brief (ADC_IER) General Overrun Error Interrupt Enable */
#define ADC_IER_COMPE (0x1u << 26) /**< \brief (ADC_IER) Comparison Event Interrupt Enable */
#define ADC_IER_ENDRX (0x1u << 27) /**< \brief (ADC_IER) End of Receive Transfer Interrupt Enable */
#define ADC_IER_RXBUFF (0x1u << 28) /**< \brief (ADC_IER) Receive Buffer Full Interrupt Enable */
/* -------- ADC_IDR : (ADC Offset: 0x28) Interrupt Disable Register -------- */
#define ADC_IDR_RXRDY (0x1u << 0) /**< \brief (ADC_IDR) Receive Ready Interrupt Disable */
#define ADC_IDR_RXEMPTY (0x1u << 1) /**< \brief (ADC_IDR) Receive FIFO Empty Interrupt Disable */
#define ADC_IDR_RXFULL (0x1u << 2) /**< \brief (ADC_IDR) Receive FIFO Full Interrupt Disable */
#define ADC_IDR_RXCHUNK (0x1u << 3) /**< \brief (ADC_IDR) Receive FIFO Chunk Interrupt Disable */
#define ADC_IDR_RXUDR (0x1u << 4) /**< \brief (ADC_IDR) Receive Under Flow Interrupt Disable */
#define ADC_IDR_RXOVR (0x1u << 5) /**< \brief (ADC_IDR) Receive Over Flow Interrupt Disable */
#define ADC_IDR_VADCSMEV (0x1u << 6) /**< \brief (ADC_IDR) VDD ADC Supply Monitor Event Interrupt Disable */
#define ADC_IDR_EOS (0x1u << 18) /**< \brief (ADC_IDR) End Of Sequence Interrupt Disable */
#define ADC_IDR_TEMPCHG (0x1u << 19) /**< \brief (ADC_IDR) Temperature Change Interrupt Disable */
#define ADC_IDR_DRDY (0x1u << 24) /**< \brief (ADC_IDR) Data Ready Interrupt Disable */
#define ADC_IDR_GOVRE (0x1u << 25) /**< \brief (ADC_IDR) General Overrun Error Interrupt Disable */
#define ADC_IDR_COMPE (0x1u << 26) /**< \brief (ADC_IDR) Comparison Event Interrupt Disable */
#define ADC_IDR_ENDRX (0x1u << 27) /**< \brief (ADC_IDR) End of Receive Transfer Interrupt Disable */
#define ADC_IDR_RXBUFF (0x1u << 28) /**< \brief (ADC_IDR) Receive Buffer Full Interrupt Disable */
/* -------- ADC_IMR : (ADC Offset: 0x2C) Interrupt Mask Register -------- */
#define ADC_IMR_RXRDY (0x1u << 0) /**< \brief (ADC_IMR) Receive Ready Interrupt Mask */
#define ADC_IMR_RXEMPTY (0x1u << 1) /**< \brief (ADC_IMR) Receive FIFO Empty Interrupt Mask */
#define ADC_IMR_RXFULL (0x1u << 2) /**< \brief (ADC_IMR) Receive FIFO Full Interrupt Mask */
#define ADC_IMR_RXCHUNK (0x1u << 3) /**< \brief (ADC_IMR) Receive FIFO Chunk Interrupt Mask */
#define ADC_IMR_RXUDR (0x1u << 4) /**< \brief (ADC_IMR) Receive Under Flow Interrupt Mask */
#define ADC_IMR_RXOVR (0x1u << 5) /**< \brief (ADC_IMR) Receive Over Flow Interrupt Mask */
#define ADC_IMR_VADCSMEV (0x1u << 6) /**< \brief (ADC_IMR) VDD ADC Supply Monitor Event Interrupt Mask */
#define ADC_IMR_EOS (0x1u << 18) /**< \brief (ADC_IMR) End Of Sequence Interrupt Mask */
#define ADC_IMR_TEMPCHG (0x1u << 19) /**< \brief (ADC_IMR) Temperature Change Interrupt Mask */
#define ADC_IMR_DRDY (0x1u << 24) /**< \brief (ADC_IMR) Data Ready Interrupt Mask */
#define ADC_IMR_GOVRE (0x1u << 25) /**< \brief (ADC_IMR) General Overrun Error Interrupt Mask */
#define ADC_IMR_COMPE (0x1u << 26) /**< \brief (ADC_IMR) Comparison Event Interrupt Mask */
#define ADC_IMR_ENDRX (0x1u << 27) /**< \brief (ADC_IMR) End of Receive Transfer Interrupt Mask */
#define ADC_IMR_RXBUFF (0x1u << 28) /**< \brief (ADC_IMR) Receive Buffer Full Interrupt Mask */
/* -------- ADC_ISR : (ADC Offset: 0x30) Interrupt Status Register -------- */
#define ADC_ISR_RXRDY (0x1u << 0) /**< \brief (ADC_ISR) Receive Ready (cleared on read) */
#define ADC_ISR_RXEMPTY (0x1u << 1) /**< \brief (ADC_ISR) Receive FIFO Empty (cleared on read) */
#define ADC_ISR_RXFULL (0x1u << 2) /**< \brief (ADC_ISR) Receive FIFO Full (cleared on read) */
#define ADC_ISR_RXCHUNK (0x1u << 3) /**< \brief (ADC_ISR) Receive FIFO Chunk (cleared on read) */
#define ADC_ISR_RXUDR (0x1u << 4) /**< \brief (ADC_ISR) Receive Under Flow (cleared on read) */
#define ADC_ISR_RXOVR (0x1u << 5) /**< \brief (ADC_ISR) Receive Over Flow (cleared on read) */
#define ADC_ISR_VADCSMEV (0x1u << 6) /**< \brief (ADC_ISR) VDD ADC Supply Monitor Event (cleared on read) */
#define ADC_ISR_EOS (0x1u << 18) /**< \brief (ADC_ISR) End Of Sequence (cleared on read) */
#define ADC_ISR_TEMPCHG (0x1u << 19) /**< \brief (ADC_ISR) Temperature Change (cleared on read) */
#define ADC_ISR_DRDY (0x1u << 24) /**< \brief (ADC_ISR) Data Ready (automatically set / cleared) */
#define ADC_ISR_GOVRE (0x1u << 25) /**< \brief (ADC_ISR) General Overrun Error (cleared on read) */
#define ADC_ISR_COMPE (0x1u << 26) /**< \brief (ADC_ISR) Comparison Event (cleared on read) */
#define ADC_ISR_ENDRX (0x1u << 27) /**< \brief (ADC_ISR) End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR) */
#define ADC_ISR_RXBUFF (0x1u << 28) /**< \brief (ADC_ISR) Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR) */
/* -------- ADC_EOC_IER : (ADC Offset: 0x34) End Of Conversion Interrupt Enable Register -------- */
#define ADC_EOC_IER_EOC0 (0x1u << 0) /**< \brief (ADC_EOC_IER) End of Conversion Interrupt Enable 0 */
#define ADC_EOC_IER_EOC1 (0x1u << 1) /**< \brief (ADC_EOC_IER) End of Conversion Interrupt Enable 1 */
#define ADC_EOC_IER_EOC2 (0x1u << 2) /**< \brief (ADC_EOC_IER) End of Conversion Interrupt Enable 2 */
#define ADC_EOC_IER_EOC3 (0x1u << 3) /**< \brief (ADC_EOC_IER) End of Conversion Interrupt Enable 3 */
#define ADC_EOC_IER_EOC4 (0x1u << 4) /**< \brief (ADC_EOC_IER) End of Conversion Interrupt Enable 4 */
#define ADC_EOC_IER_EOC5 (0x1u << 5) /**< \brief (ADC_EOC_IER) End of Conversion Interrupt Enable 5 */
#define ADC_EOC_IER_EOC6 (0x1u << 6) /**< \brief (ADC_EOC_IER) End of Conversion Interrupt Enable 6 */
#define ADC_EOC_IER_EOC7 (0x1u << 7) /**< \brief (ADC_EOC_IER) End of Conversion Interrupt Enable 7 */
/* -------- ADC_EOC_IDR : (ADC Offset: 0x38) End Of Conversion Interrupt Disable Register -------- */
#define ADC_EOC_IDR_EOC0 (0x1u << 0) /**< \brief (ADC_EOC_IDR) End of Conversion Interrupt Disable 0 */
#define ADC_EOC_IDR_EOC1 (0x1u << 1) /**< \brief (ADC_EOC_IDR) End of Conversion Interrupt Disable 1 */
#define ADC_EOC_IDR_EOC2 (0x1u << 2) /**< \brief (ADC_EOC_IDR) End of Conversion Interrupt Disable 2 */
#define ADC_EOC_IDR_EOC3 (0x1u << 3) /**< \brief (ADC_EOC_IDR) End of Conversion Interrupt Disable 3 */
#define ADC_EOC_IDR_EOC4 (0x1u << 4) /**< \brief (ADC_EOC_IDR) End of Conversion Interrupt Disable 4 */
#define ADC_EOC_IDR_EOC5 (0x1u << 5) /**< \brief (ADC_EOC_IDR) End of Conversion Interrupt Disable 5 */
#define ADC_EOC_IDR_EOC6 (0x1u << 6) /**< \brief (ADC_EOC_IDR) End of Conversion Interrupt Disable 6 */
#define ADC_EOC_IDR_EOC7 (0x1u << 7) /**< \brief (ADC_EOC_IDR) End of Conversion Interrupt Disable 7 */
/* -------- ADC_EOC_IMR : (ADC Offset: 0x3C) End Of Conversion Interrupt Mask Register -------- */
#define ADC_EOC_IMR_EOC0 (0x1u << 0) /**< \brief (ADC_EOC_IMR) End of Conversion Interrupt Mask 0 */
#define ADC_EOC_IMR_EOC1 (0x1u << 1) /**< \brief (ADC_EOC_IMR) End of Conversion Interrupt Mask 1 */
#define ADC_EOC_IMR_EOC2 (0x1u << 2) /**< \brief (ADC_EOC_IMR) End of Conversion Interrupt Mask 2 */
#define ADC_EOC_IMR_EOC3 (0x1u << 3) /**< \brief (ADC_EOC_IMR) End of Conversion Interrupt Mask 3 */
#define ADC_EOC_IMR_EOC4 (0x1u << 4) /**< \brief (ADC_EOC_IMR) End of Conversion Interrupt Mask 4 */
#define ADC_EOC_IMR_EOC5 (0x1u << 5) /**< \brief (ADC_EOC_IMR) End of Conversion Interrupt Mask 5 */
#define ADC_EOC_IMR_EOC6 (0x1u << 6) /**< \brief (ADC_EOC_IMR) End of Conversion Interrupt Mask 6 */
#define ADC_EOC_IMR_EOC7 (0x1u << 7) /**< \brief (ADC_EOC_IMR) End of Conversion Interrupt Mask 7 */
/* -------- ADC_EOC_ISR : (ADC Offset: 0x40) End Of Conversion Interrupt Status Register -------- */
#define ADC_EOC_ISR_EOC0 (0x1u << 0) /**< \brief (ADC_EOC_ISR) End of Conversion 0 (automatically set / cleared) */
#define ADC_EOC_ISR_EOC1 (0x1u << 1) /**< \brief (ADC_EOC_ISR) End of Conversion 1 (automatically set / cleared) */
#define ADC_EOC_ISR_EOC2 (0x1u << 2) /**< \brief (ADC_EOC_ISR) End of Conversion 2 (automatically set / cleared) */
#define ADC_EOC_ISR_EOC3 (0x1u << 3) /**< \brief (ADC_EOC_ISR) End of Conversion 3 (automatically set / cleared) */
#define ADC_EOC_ISR_EOC4 (0x1u << 4) /**< \brief (ADC_EOC_ISR) End of Conversion 4 (automatically set / cleared) */
#define ADC_EOC_ISR_EOC5 (0x1u << 5) /**< \brief (ADC_EOC_ISR) End of Conversion 5 (automatically set / cleared) */
#define ADC_EOC_ISR_EOC6 (0x1u << 6) /**< \brief (ADC_EOC_ISR) End of Conversion 6 (automatically set / cleared) */
#define ADC_EOC_ISR_EOC7 (0x1u << 7) /**< \brief (ADC_EOC_ISR) End of Conversion 7 (automatically set / cleared) */
/* -------- ADC_TEMPMR : (ADC Offset: 0x44) Temperature Sensor Mode Register -------- */
#define ADC_TEMPMR_TEMPON (0x1u << 0) /**< \brief (ADC_TEMPMR) Temperature Sensor On */
#define ADC_TEMPMR_TEMPCMPMOD_Pos 4
#define ADC_TEMPMR_TEMPCMPMOD_Msk (0x3u << ADC_TEMPMR_TEMPCMPMOD_Pos) /**< \brief (ADC_TEMPMR) Temperature Comparison Mode */
#define ADC_TEMPMR_TEMPCMPMOD(value) ((ADC_TEMPMR_TEMPCMPMOD_Msk & ((value) << ADC_TEMPMR_TEMPCMPMOD_Pos)))
#define   ADC_TEMPMR_TEMPCMPMOD_LOW (0x0u << 4) /**< \brief (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is lower than the low threshold of the window. */
#define   ADC_TEMPMR_TEMPCMPMOD_HIGH (0x1u << 4) /**< \brief (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is higher than the high threshold of the window. */
#define   ADC_TEMPMR_TEMPCMPMOD_IN (0x2u << 4) /**< \brief (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is in the comparison window. */
#define   ADC_TEMPMR_TEMPCMPMOD_OUT (0x3u << 4) /**< \brief (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is out of the comparison window. */
/* -------- ADC_TEMPCWR : (ADC Offset: 0x48) Temperature Compare Window Register -------- */
#define ADC_TEMPCWR_TLOWTHRES_Pos 0
#define ADC_TEMPCWR_TLOWTHRES_Msk (0xfffu << ADC_TEMPCWR_TLOWTHRES_Pos) /**< \brief (ADC_TEMPCWR) Temperature Low Threshold */
#define ADC_TEMPCWR_TLOWTHRES(value) ((ADC_TEMPCWR_TLOWTHRES_Msk & ((value) << ADC_TEMPCWR_TLOWTHRES_Pos)))
#define ADC_TEMPCWR_THIGHTHRES_Pos 16
#define ADC_TEMPCWR_THIGHTHRES_Msk (0xfffu << ADC_TEMPCWR_THIGHTHRES_Pos) /**< \brief (ADC_TEMPCWR) Temperature High Threshold */
#define ADC_TEMPCWR_THIGHTHRES(value) ((ADC_TEMPCWR_THIGHTHRES_Msk & ((value) << ADC_TEMPCWR_THIGHTHRES_Pos)))
/* -------- ADC_OVER : (ADC Offset: 0x4C) Overrun Status Register -------- */
#define ADC_OVER_OVRE0 (0x1u << 0) /**< \brief (ADC_OVER) Overrun Error 0 */
#define ADC_OVER_OVRE1 (0x1u << 1) /**< \brief (ADC_OVER) Overrun Error 1 */
#define ADC_OVER_OVRE2 (0x1u << 2) /**< \brief (ADC_OVER) Overrun Error 2 */
#define ADC_OVER_OVRE3 (0x1u << 3) /**< \brief (ADC_OVER) Overrun Error 3 */
#define ADC_OVER_OVRE4 (0x1u << 4) /**< \brief (ADC_OVER) Overrun Error 4 */
#define ADC_OVER_OVRE5 (0x1u << 5) /**< \brief (ADC_OVER) Overrun Error 5 */
#define ADC_OVER_OVRE6 (0x1u << 6) /**< \brief (ADC_OVER) Overrun Error 6 */
#define ADC_OVER_OVRE7 (0x1u << 7) /**< \brief (ADC_OVER) Overrun Error 7 */
/* -------- ADC_EMR : (ADC Offset: 0x50) Extended Mode Register -------- */
#define ADC_EMR_CMPMODE_Pos 0
