ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/adc.h
#define ADC_EMR_CMPMODE_Msk (0x3u << ADC_EMR_CMPMODE_Pos) /**< \brief (ADC_EMR) Comparison Mode */
#define ADC_EMR_CMPMODE(value) ((ADC_EMR_CMPMODE_Msk & ((value) << ADC_EMR_CMPMODE_Pos)))
#define   ADC_EMR_CMPMODE_LOW (0x0u << 0) /**< \brief (ADC_EMR) When the converted data is lower than the low threshold of the window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit the system from Wait mode. */
#define   ADC_EMR_CMPMODE_HIGH (0x1u << 0) /**< \brief (ADC_EMR) When the converted data is higher than the high threshold of the window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit the system from Wait mode. */
#define   ADC_EMR_CMPMODE_IN (0x2u << 0) /**< \brief (ADC_EMR) When the converted data is in the comparison window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit the system from Wait mode. */
#define   ADC_EMR_CMPMODE_OUT (0x3u << 0) /**< \brief (ADC_EMR) When the converted data is out of the comparison window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit the system from Wait mode. */
#define ADC_EMR_CMPTYPE (0x1u << 2) /**< \brief (ADC_EMR) Comparison Type */
#define   ADC_EMR_CMPTYPE_FLAG_ONLY (0x0u << 2) /**< \brief (ADC_EMR) Any conversion is performed and comparison function drives the COMPE flag. */
#define   ADC_EMR_CMPTYPE_START_CONDITION (0x1u << 2) /**< \brief (ADC_EMR) Comparison conditions must be met to start the storage of all conversions until ADC_CR.CMPRST is set. */
#define ADC_EMR_CMPSEL_Pos 4
#define ADC_EMR_CMPSEL_Msk (0x1fu << ADC_EMR_CMPSEL_Pos) /**< \brief (ADC_EMR) Comparison Selected Channel */
#define ADC_EMR_CMPSEL(value) ((ADC_EMR_CMPSEL_Msk & ((value) << ADC_EMR_CMPSEL_Pos)))
#define ADC_EMR_CMPALL (0x1u << 9) /**< \brief (ADC_EMR) Compare All Channels */
#define ADC_EMR_CMPFILTER_Pos 12
#define ADC_EMR_CMPFILTER_Msk (0x3u << ADC_EMR_CMPFILTER_Pos) /**< \brief (ADC_EMR) Compare Event Filtering */
#define ADC_EMR_CMPFILTER(value) ((ADC_EMR_CMPFILTER_Msk & ((value) << ADC_EMR_CMPFILTER_Pos)))
#define ADC_EMR_OSR_Pos 16
#define ADC_EMR_OSR_Msk (0x7u << ADC_EMR_OSR_Pos) /**< \brief (ADC_EMR) Over Sampling Rate */
#define ADC_EMR_OSR(value) ((ADC_EMR_OSR_Msk & ((value) << ADC_EMR_OSR_Pos)))
#define   ADC_EMR_OSR_NO_AVERAGE (0x0u << 16) /**< \brief (ADC_EMR) No averaging. ADC sample rate is maximum. */
#define   ADC_EMR_OSR_OSR4 (0x1u << 16) /**< \brief (ADC_EMR) 1-bit enhanced resolution by averaging. ADC sample rate divided by 4. */
#define   ADC_EMR_OSR_OSR16 (0x2u << 16) /**< \brief (ADC_EMR) 2-bit enhanced resolution by averaging. ADC sample rate divided by 16. */
#define   ADC_EMR_OSR_OSR64 (0x3u << 16) /**< \brief (ADC_EMR) 1-bit enhanced resolution by averaging. ADC sample rate divided by 64 */
#define   ADC_EMR_OSR_OSR256 (0x4u << 16) /**< \brief (ADC_EMR) 2-bit enhanced resolution by averaging. ADC sample rate divided by 256. */
#define ADC_EMR_ASTE (0x1u << 20) /**< \brief (ADC_EMR) Averaging on Single Trigger Event */
#define   ADC_EMR_ASTE_MULTI_TRIG_AVERAGE (0x0u << 20) /**< \brief (ADC_EMR) The average requests several trigger events. */
#define   ADC_EMR_ASTE_SINGLE_TRIG_AVERAGE (0x1u << 20) /**< \brief (ADC_EMR) The average requests only one trigger event. */
#define ADC_EMR_SRCCLK (0x1u << 21) /**< \brief (ADC_EMR) External Clock Selection */
#define   ADC_EMR_SRCCLK_PERIPH_CLK (0x0u << 21) /**< \brief (ADC_EMR) The peripheral clock is the source for the ADC prescaler. */
#define   ADC_EMR_SRCCLK_GCLK (0x1u << 21) /**< \brief (ADC_EMR) GCLK is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock. */
#define ADC_EMR_TRACKX_Pos 22
#define ADC_EMR_TRACKX_Msk (0x3u << ADC_EMR_TRACKX_Pos) /**< \brief (ADC_EMR) Tracking Time x4, x8 or x16 */
#define ADC_EMR_TRACKX(value) ((ADC_EMR_TRACKX_Msk & ((value) << ADC_EMR_TRACKX_Pos)))
#define   ADC_EMR_TRACKX_TRACKTIMX1 (0x0u << 22) /**< \brief (ADC_EMR) ADC_MR.TRACKTIM effect is multiplied by 1. */
#define   ADC_EMR_TRACKX_TRACKTIMX4 (0x1u << 22) /**< \brief (ADC_EMR) ADC_MR.TRACKTIM effect is multiplied by 4. */
#define   ADC_EMR_TRACKX_TRACKTIMX8 (0x2u << 22) /**< \brief (ADC_EMR) ADC_MR.TRACKTIM effect is multiplied by 8 */
#define   ADC_EMR_TRACKX_TRACKTIMX16 (0x3u << 22) /**< \brief (ADC_EMR) ADC_MR.TRACKTIM effect is multiplied by 16. */
#define ADC_EMR_TAG (0x1u << 24) /**< \brief (ADC_EMR) ADC_LCDR Tag */
#define ADC_EMR_SIGNMODE_Pos 25
#define ADC_EMR_SIGNMODE_Msk (0x3u << ADC_EMR_SIGNMODE_Pos) /**< \brief (ADC_EMR) Sign Mode */
#define ADC_EMR_SIGNMODE(value) ((ADC_EMR_SIGNMODE_Msk & ((value) << ADC_EMR_SIGNMODE_Pos)))
#define   ADC_EMR_SIGNMODE_SE_UNSG_DF_SIGN (0x0u << 25) /**< \brief (ADC_EMR) Single-ended channels: unsigned conversions Differential channels: signed conversions */
#define   ADC_EMR_SIGNMODE_SE_SIGN_DF_UNSG (0x1u << 25) /**< \brief (ADC_EMR) Single-ended channels: signed conversions Differential channels: unsigned conversions */
#define   ADC_EMR_SIGNMODE_ALL_UNSIGNED (0x2u << 25) /**< \brief (ADC_EMR) All channels: unsigned conversions */
#define   ADC_EMR_SIGNMODE_ALL_SIGNED (0x3u << 25) /**< \brief (ADC_EMR) All channels: signed conversions */
#define ADC_EMR_ADCMODE_Pos 28
#define ADC_EMR_ADCMODE_Msk (0x3u << ADC_EMR_ADCMODE_Pos) /**< \brief (ADC_EMR) ADC Running Mode */
#define ADC_EMR_ADCMODE(value) ((ADC_EMR_ADCMODE_Msk & ((value) << ADC_EMR_ADCMODE_Pos)))
#define   ADC_EMR_ADCMODE_NORMAL (0x0u << 28) /**< \brief (ADC_EMR) Normal mode of operation. */
#define   ADC_EMR_ADCMODE_OFFSET_ERROR (0x1u << 28) /**< \brief (ADC_EMR) Offset Error mode to measure the offset error. See Table 6-6 "ADC Running Modes". */
#define   ADC_EMR_ADCMODE_GAIN_ERROR_HIGH (0x2u << 28) /**< \brief (ADC_EMR) Gain Error mode to measure the gain error. See Table 6-6 "ADC Running Modes". */
#define   ADC_EMR_ADCMODE_GAIN_ERROR_LOW (0x3u << 28) /**< \brief (ADC_EMR) Gain Error mode to measure the gain error. See Table 6-6 "ADC Running Modes". */
/* -------- ADC_CWR : (ADC Offset: 0x54) Compare Window Register -------- */
#define ADC_CWR_LOWTHRES_Pos 0
#define ADC_CWR_LOWTHRES_Msk (0xffffu << ADC_CWR_LOWTHRES_Pos) /**< \brief (ADC_CWR) Low Threshold */
#define ADC_CWR_LOWTHRES(value) ((ADC_CWR_LOWTHRES_Msk & ((value) << ADC_CWR_LOWTHRES_Pos)))
#define ADC_CWR_HIGHTHRES_Pos 16
#define ADC_CWR_HIGHTHRES_Msk (0xffffu << ADC_CWR_HIGHTHRES_Pos) /**< \brief (ADC_CWR) High Threshold */
#define ADC_CWR_HIGHTHRES(value) ((ADC_CWR_HIGHTHRES_Msk & ((value) << ADC_CWR_HIGHTHRES_Pos)))
/* -------- ADC_CCR : (ADC Offset: 0x5C) Channel Configuration Register -------- */
#define ADC_CCR_DIFF0 (0x1u << 0) /**< \brief (ADC_CCR) Differential Inputs for Channel 0 */
#define ADC_CCR_DIFF1 (0x1u << 1) /**< \brief (ADC_CCR) Differential Inputs for Channel 1 */
#define ADC_CCR_DIFF2 (0x1u << 2) /**< \brief (ADC_CCR) Differential Inputs for Channel 2 */
#define ADC_CCR_DIFF3 (0x1u << 3) /**< \brief (ADC_CCR) Differential Inputs for Channel 3 */
#define ADC_CCR_DIFF4 (0x1u << 4) /**< \brief (ADC_CCR) Differential Inputs for Channel 4 */
#define ADC_CCR_DIFF5 (0x1u << 5) /**< \brief (ADC_CCR) Differential Inputs for Channel 5 */
#define ADC_CCR_DIFF6 (0x1u << 6) /**< \brief (ADC_CCR) Differential Inputs for Channel 6 */
#define ADC_CCR_DIFF7 (0x1u << 7) /**< \brief (ADC_CCR) Differential Inputs for Channel 7 */
/* -------- ADC_CDR[8] : (ADC Offset: 0x60) Channel Data Register -------- */
#define ADC_CDR_DATA_Pos 0
#define ADC_CDR_DATA_Msk (0xffffu << ADC_CDR_DATA_Pos) /**< \brief (ADC_CDR[8]) Converted Data */
/* -------- ADC_ACR : (ADC Offset: 0xE0) Analog Control Register -------- */
#define ADC_ACR_ZBAT (0x1u << 2) /**< \brief (ADC_ACR) VBAT Load Enable */
#define ADC_ACR_INTVREFEN (0x1u << 20) /**< \brief (ADC_ACR) ADC Internal Positive Voltage Reference Enable */
#define ADC_ACR_SMEN (0x1u << 21) /**< \brief (ADC_ACR) Supply Monitor Enable */
#define ADC_ACR_SMVT (0x1u << 22) /**< \brief (ADC_ACR) Supply Monitor Voltage Threshold */
/* -------- ADC_FMR : (ADC Offset: 0xE4) FIFO Mode Register -------- */
#define ADC_FMR_ENFIFO (0x1u << 0) /**< \brief (ADC_FMR) Enable FIFO */
#define ADC_FMR_ENLEVEL (0x1u << 1) /**< \brief (ADC_FMR) Enable Level */
#define ADC_FMR_CHUNK_Pos 4
#define ADC_FMR_CHUNK_Msk (0xfu << ADC_FMR_CHUNK_Pos) /**< \brief (ADC_FMR) Chunk Size */
#define ADC_FMR_CHUNK(value) ((ADC_FMR_CHUNK_Msk & ((value) << ADC_FMR_CHUNK_Pos)))
#define ADC_FMR_FIFOCNT_Pos 16
#define ADC_FMR_FIFOCNT_Msk (0xffu << ADC_FMR_FIFOCNT_Pos) /**< \brief (ADC_FMR) FIFO Count (read-only) */
#define ADC_FMR_FIFOCNT(value) ((ADC_FMR_FIFOCNT_Msk & ((value) << ADC_FMR_FIFOCNT_Pos)))
/* -------- ADC_RPR : (ADC Offset: 0x100) Receive Pointer Register -------- */
#define ADC_RPR_RXPTR_Pos 0
#define ADC_RPR_RXPTR_Msk (0xffffffffu << ADC_RPR_RXPTR_Pos) /**< \brief (ADC_RPR) Receive Pointer Register */
#define ADC_RPR_RXPTR(value) ((ADC_RPR_RXPTR_Msk & ((value) << ADC_RPR_RXPTR_Pos)))
/* -------- ADC_RCR : (ADC Offset: 0x104) Receive Counter Register -------- */
#define ADC_RCR_RXCTR_Pos 0
#define ADC_RCR_RXCTR_Msk (0xffffu << ADC_RCR_RXCTR_Pos) /**< \brief (ADC_RCR) Receive Counter Register */
#define ADC_RCR_RXCTR(value) ((ADC_RCR_RXCTR_Msk & ((value) << ADC_RCR_RXCTR_Pos)))
/* -------- ADC_RNPR : (ADC Offset: 0x110) Receive Next Pointer Register -------- */
#define ADC_RNPR_RXNPTR_Pos 0
#define ADC_RNPR_RXNPTR_Msk (0xffffffffu << ADC_RNPR_RXNPTR_Pos) /**< \brief (ADC_RNPR) Receive Next Pointer */
#define ADC_RNPR_RXNPTR(value) ((ADC_RNPR_RXNPTR_Msk & ((value) << ADC_RNPR_RXNPTR_Pos)))
/* -------- ADC_RNCR : (ADC Offset: 0x114) Receive Next Counter Register -------- */
#define ADC_RNCR_RXNCTR_Pos 0
#define ADC_RNCR_RXNCTR_Msk (0xffffu << ADC_RNCR_RXNCTR_Pos) /**< \brief (ADC_RNCR) Receive Next Counter */
#define ADC_RNCR_RXNCTR(value) ((ADC_RNCR_RXNCTR_Msk & ((value) << ADC_RNCR_RXNCTR_Pos)))
/* -------- ADC_PTCR : (ADC Offset: 0x120) Transfer Control Register -------- */
#define ADC_PTCR_RXTEN (0x1u << 0) /**< \brief (ADC_PTCR) Receiver Transfer Enable */
#define ADC_PTCR_RXTDIS (0x1u << 1) /**< \brief (ADC_PTCR) Receiver Transfer Disable */
#define ADC_PTCR_TXTEN (0x1u << 8) /**< \brief (ADC_PTCR) Transmitter Transfer Enable */
#define ADC_PTCR_TXTDIS (0x1u << 9) /**< \brief (ADC_PTCR) Transmitter Transfer Disable */
#define ADC_PTCR_RXCBEN (0x1u << 16) /**< \brief (ADC_PTCR) Receiver Circular Buffer Enable */
#define ADC_PTCR_RXCBDIS (0x1u << 17) /**< \brief (ADC_PTCR) Receiver Circular Buffer Disable */
#define ADC_PTCR_TXCBEN (0x1u << 18) /**< \brief (ADC_PTCR) Transmitter Circular Buffer Enable */
#define ADC_PTCR_TXCBDIS (0x1u << 19) /**< \brief (ADC_PTCR) Transmitter Circular Buffer Disable */
#define ADC_PTCR_ERRCLR (0x1u << 24) /**< \brief (ADC_PTCR) Transfer Bus Error Clear */
/* -------- ADC_PTSR : (ADC Offset: 0x124) Transfer Status Register -------- */
#define ADC_PTSR_RXTEN (0x1u << 0) /**< \brief (ADC_PTSR) Receiver Transfer Enable */
#define ADC_PTSR_TXTEN (0x1u << 8) /**< \brief (ADC_PTSR) Transmitter Transfer Enable */
#define ADC_PTSR_RXCBEN (0x1u << 16) /**< \brief (ADC_PTSR) Receiver Circular Buffer Enable */
#define ADC_PTSR_TXCBEN (0x1u << 18) /**< \brief (ADC_PTSR) Transmitter Circular Buffer Enable */
#define ADC_PTSR_ERR (0x1u << 24) /**< \brief (ADC_PTSR) Transfer Bus Error */
/* -------- ADC_PWPMR : (ADC Offset: 0x128) Write Protection Mode Register -------- */
#define ADC_PWPMR_WPPTREN (0x1u << 0) /**< \brief (ADC_PWPMR) Write Protection Pointer Registers Enable */
#define ADC_PWPMR_WPCTREN (0x1u << 1) /**< \brief (ADC_PWPMR) Write Protection Counter Registers Enable */
#define ADC_PWPMR_WPCREN (0x1u << 2) /**< \brief (ADC_PWPMR) Write Protection Control Register Enable */
#define ADC_PWPMR_WPKEY_Pos 8
#define ADC_PWPMR_WPKEY_Msk (0xffffffu << ADC_PWPMR_WPKEY_Pos) /**< \brief (ADC_PWPMR) Write Protection Key */
#define ADC_PWPMR_WPKEY(value) ((ADC_PWPMR_WPKEY_Msk & ((value) << ADC_PWPMR_WPKEY_Pos)))
#define   ADC_PWPMR_WPKEY_PASSWD (0x504443u << 8) /**< \brief (ADC_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. */
/* -------- ADC_TRGR : (ADC Offset: 0x130) Trigger Register -------- */
#define ADC_TRGR_TRGMOD_Pos 0
#define ADC_TRGR_TRGMOD_Msk (0x7u << ADC_TRGR_TRGMOD_Pos) /**< \brief (ADC_TRGR) Trigger Mode */
#define ADC_TRGR_TRGMOD(value) ((ADC_TRGR_TRGMOD_Msk & ((value) << ADC_TRGR_TRGMOD_Pos)))
#define   ADC_TRGR_TRGMOD_NO_TRIGGER (0x0u << 0) /**< \brief (ADC_TRGR) No hardware trigger, only software trigger can start conversions */
#define   ADC_TRGR_TRGMOD_EXT_TRIG_RISE (0x1u << 0) /**< \brief (ADC_TRGR) Rising edge of the selected trigger event, defined in ADC_MR.TRGSEL */
#define   ADC_TRGR_TRGMOD_EXT_TRIG_FALL (0x2u << 0) /**< \brief (ADC_TRGR) Falling edge of the selected trigger event */
#define   ADC_TRGR_TRGMOD_EXT_TRIG_ANY (0x3u << 0) /**< \brief (ADC_TRGR) Any edge of the selected trigger event */
#define   ADC_TRGR_TRGMOD_PERIOD_TRIG (0x5u << 0) /**< \brief (ADC_TRGR) ADC internal periodic trigger (see TRGPER) */
#define   ADC_TRGR_TRGMOD_CONTINUOUS (0x6u << 0) /**< \brief (ADC_TRGR) Continuous mode, free run mode */
#define ADC_TRGR_TRGPER_Pos 8
#define ADC_TRGR_TRGPER_Msk (0xffffffu << ADC_TRGR_TRGPER_Pos) /**< \brief (ADC_TRGR) Trigger Period */
#define ADC_TRGR_TRGPER(value) ((ADC_TRGR_TRGPER_Msk & ((value) << ADC_TRGR_TRGPER_Pos)))
/* -------- ADC_COSR : (ADC Offset: 0x134) Correction Select Register -------- */
#define ADC_COSR_CSEL_Pos 0
#define ADC_COSR_CSEL_Msk (0x1fu << ADC_COSR_CSEL_Pos) /**< \brief (ADC_COSR) Channel Correction Select */
#define ADC_COSR_CSEL(value) ((ADC_COSR_CSEL_Msk & ((value) << ADC_COSR_CSEL_Pos)))
/* -------- ADC_CVR : (ADC Offset: 0x138) Correction Values Register -------- */
#define ADC_CVR_OFFSETCORR_Pos 0
#define ADC_CVR_OFFSETCORR_Msk (0xffffu << ADC_CVR_OFFSETCORR_Pos) /**< \brief (ADC_CVR) Offset Correction */
#define ADC_CVR_OFFSETCORR(value) ((ADC_CVR_OFFSETCORR_Msk & ((value) << ADC_CVR_OFFSETCORR_Pos)))
#define ADC_CVR_GAINCORR_Pos 16
#define ADC_CVR_GAINCORR_Msk (0xffffu << ADC_CVR_GAINCORR_Pos) /**< \brief (ADC_CVR) Gain Correction */
#define ADC_CVR_GAINCORR(value) ((ADC_CVR_GAINCORR_Msk & ((value) << ADC_CVR_GAINCORR_Pos)))
/* -------- ADC_CECR : (ADC Offset: 0x13C) Channel Error Correction Register -------- */
#define ADC_CECR_ECORR0 (0x1u << 0) /**< \brief (ADC_CECR) Error Correction Enable for Channel 0 */
#define ADC_CECR_ECORR1 (0x1u << 1) /**< \brief (ADC_CECR) Error Correction Enable for Channel 1 */
#define ADC_CECR_ECORR2 (0x1u << 2) /**< \brief (ADC_CECR) Error Correction Enable for Channel 2 */
#define ADC_CECR_ECORR3 (0x1u << 3) /**< \brief (ADC_CECR) Error Correction Enable for Channel 3 */
#define ADC_CECR_ECORR4 (0x1u << 4) /**< \brief (ADC_CECR) Error Correction Enable for Channel 4 */
#define ADC_CECR_ECORR5 (0x1u << 5) /**< \brief (ADC_CECR) Error Correction Enable for Channel 5 */
#define ADC_CECR_ECORR6 (0x1u << 6) /**< \brief (ADC_CECR) Error Correction Enable for Channel 6 */
#define ADC_CECR_ECORR7 (0x1u << 7) /**< \brief (ADC_CECR) Error Correction Enable for Channel 7 */
/* -------- ADC_SR : (ADC Offset: 0x144) Status Register -------- */
#define ADC_SR_VADCSM (0x1u << 0) /**< \brief (ADC_SR) VDD ADC Supply Monitor Output */
/* -------- ADC_WPMR : (ADC Offset: 0x14C) Write Protection Mode Register -------- */
#define ADC_WPMR_WPEN (0x1u << 0) /**< \brief (ADC_WPMR) Write Protection Enable */
#define ADC_WPMR_WPITEN (0x1u << 1) /**< \brief (ADC_WPMR) Write Protection Interrupt Enable */
#define ADC_WPMR_WPCREN (0x1u << 2) /**< \brief (ADC_WPMR) Write Protection Control Register Enable */
#define ADC_WPMR_WPKEY_Pos 8
#define ADC_WPMR_WPKEY_Msk (0xffffffu << ADC_WPMR_WPKEY_Pos) /**< \brief (ADC_WPMR) Write Protection Key */
#define ADC_WPMR_WPKEY(value) ((ADC_WPMR_WPKEY_Msk & ((value) << ADC_WPMR_WPKEY_Pos)))
#define   ADC_WPMR_WPKEY_PASSWD (0x414443u << 8) /**< \brief (ADC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. */
/* -------- ADC_WPSR : (ADC Offset: 0x150) Write Protection Status Register -------- */
#define ADC_WPSR_WPVS (0x1u << 0) /**< \brief (ADC_WPSR) Write Protection Violation Status */
#define ADC_WPSR_WPVSRC_Pos 8
#define ADC_WPSR_WPVSRC_Msk (0xffffu << ADC_WPSR_WPVSRC_Pos) /**< \brief (ADC_WPSR) Write Protection Violation Source */

/*@}*/


#endif /* _PIC32CX_ADC_COMPONENT_ */
